app/controllers/api/decades_controller.rb

  def create
    render json: @current_user.decades.create(decade_params)
---
INSERT INTO "decades" ("comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "m"], ["user_id", 1], ["created_at", "2015-10-10 18:52:05.944266"], ["updated_at", "2015-10-10 18:52:05.944266"]]

  def destroy
    @current_user.decades.destroy(params[:id])
---
DELETE FROM "decades" WHERE "decades"."id" = $1  [["id", 3]]